{
    "title": "Caio Ferreira</br>Front End Developer",
    "description" : "I am a front-end developer with over 6 years of experience in the field. My main focus is on developing modern and functional websites using technologies such as <strong>HTML, CSS, JavaScript, jQuery, PHP, and WordPress.</strong>",
    "image" : "https://raw.githubusercontent.com/caiovf/react-portfolio/main/src/assets/img/profile.jpeg",
    "page_title": "Hello, I’m Caio Ferreira",
    "page_description" : "I’m a front-end developer with 6+ years of experience, building modern, responsive websites that look great and work flawlessly. From small business sites to large platforms, I’m here to create seamless user experiences.<a title='Let’s bring your vision to life!' href='https://www.linkedin.com/in/caio-ferreiradev/' target='_blank' rel='nofollow noopener noreferrer'>Let’s bring your vision to life!</a>",
    "how_work" : {
        "title": "How I Work",
        "description":"I believe that each project is unique and deserves a personalized approach. My focus is always on creating solutions that prioritize user experience, efficiency, and scalability.</br></br>I work collaboratively, always seeking a balance between design and functionality, with attention to detail and deadlines.</br></br>For me, the success of a project is delivering more than the client expects, quickly and without compromising quality.",
        "image":"https://raw.githubusercontent.com/caiovf/react-portfolio/main/src/assets/img/laptop.jpg"
    },
    "when_not_coding":{
        "title": "When i’m not coding...",
        "description": "Beyond coding, I have a deep passion for volleyball, enjoying the sport in all its forms. Whether it’s indoor, outdoor, or beach volleyball, the game always brings out my competitive side and fuels my drive for teamwork.</br></br>Recently, I’ve developed a strong love for beach volleyball, with its quick tempo and dynamic nature, much like the way I approach challenges in development—always adapting and striving for the best results.</br></br>Just as in coding, where precision and timing are key, volleyball helps me maintain focus, discipline, and a sense of balance, keeping my mind sharp and energized for the creative demands of web development.",
        "image": "https://raw.githubusercontent.com/caiovf/react-portfolio/main/src/assets/img/volley.jpg"
    },
    "lets_work":{
        "title": "Let’s Work Together",
        "description": "I’m always looking for exciting new projects and collaborations. If you’re looking to create or increase your online presence, let’s talk! <a title='Check out my portfolio' href='/portfolio' target='_blank' rel='nofollow noopener noreferrer'>Check out my portfolio</a> to see how I’ve helped businesses grow through innovative web solutions.",
        "image": "https://raw.githubusercontent.com/caiovf/react-portfolio/main/src/assets/img/profile-2.jpg"
    }
}