[
    {
        "id" : 1,
        "title" : "Mazalti Investimentos",
        "slug" : "mazalti-investimentos",
        "thumbnail" : "https://raw.githubusercontent.com/caiovf/react-portfolio/main/src/assets/img/projetos-2.png",
        "project_type": "portfolio",
        "description" : "Desenvolvi um site moderno e funcional para a Mazalti Investimentos, uma consultoria financeira, usando WordPress e Elementor. Com design responsivo, SEO otimizado e integração com RD Station, o site foi criado para captar e engajar novos investidores, resultando em um aumento significativo no número de leads.",
        "text" : "A Mazalti Investimentos, uma consultoria especializada em smart money, tinha como principal objetivo atrair novos clientes para seus serviços de investimento. Fui responsável pelo desenvolvimento completo do site, utilizando WordPress e Elementor, com integração de formulários ao RD Station para otimização de campanhas de marketing.</br></br>O público-alvo da Mazalti incluía jovens adultos a partir dos 20 anos, interessados em iniciar sua jornada no mundo dos investimentos. Um dos maiores desafios deste projeto foi a criação do layout a partir de um briefing, uma vez que eu estava habituado a trabalhar com layouts prontos. No entanto, ao solicitar referências de sites que o cliente apreciava, consegui alinhar expectativas e entregar um design que não só agradava ao cliente, mas que também era eficaz na captação de usuários.</br></br>Os resultados foram expressivos, com um aumento no número de leads após o lançamento do site, demonstrando a eficácia do design e da integração com o RD Station.",
        "categories" : [10,12],
        "link_project" : "https://mazaltiinvestimentos.com.br/",
        "link_github" : "",
        "full_project_img" : "",
        "current_online" : 0
    },
    {
        "id" : 2,
        "title" : "Miogx",
        "slug" : "miogx",
        "thumbnail" : "https://raw.githubusercontent.com/caiovf/react-portfolio/main/src/assets/img/projetos-4.jpg",
        "project_type": "portfolio",
        "description" : "Desenvolvi o site para Miogx, uma vitrine online para os trabalhos do designer Miguel, focando em Motion Design. Utilizando HTML, CSS, JavaScript, jQuery, WordPress e ACF, o site destaca a versatilidade dos projetos do cliente e conta com integração otimizada com Vimeo para exibição de vídeos em diferentes formatos.",
        "text" : "O projeto Miogx foi desenvolvido com o objetivo de criar uma vitrine digital que destacasse os diversos trabalhos de Miguel, um designer especializado em Motion Design. O site foi projetado para funcionar como um catálogo, atraindo empresas interessadas em seus serviços.</br></br>Utilizei uma combinação de HTML, CSS, JavaScript e jQuery para a estrutura e interatividade, enquanto o WordPress, em conjunto com o Advanced Custom Fields (ACF), foi escolhido como CMS para permitir uma gestão mais flexível das páginas internas. Um dos grandes desafios deste projeto foi integrar os vídeos hospedados no Vimeo, considerando a diversidade de formatos e tamanhos. Adaptar todos esses elementos para garantir uma experiência fluida em diferentes dispositivos exigiu atenção aos detalhes e testes rigorosos.</br></br>O site não só passou em todas as métricas do Google, como também foi muito bem recebido pelo cliente, Miguel, que destacou a facilidade na gestão do conteúdo e o suporte contínuo durante o desenvolvimento. Seu depoimento abaixo reforçou a satisfação com o projeto.",
        "categories" : [1,2,6,10],
        "link_project" : "https://miogx.com/",
        "link_github" : "",
        "full_project_img" : "",
        "current_online" : 1
    },    
    {
        "id" : 4,
        "title" : "Pokemon Angular",
        "slug" : "pokemon-angular",
        "thumbnail" : "https://raw.githubusercontent.com/caiovf/react-portfolio/main/src/assets/img/projeto-5.jpg",
        "project_type": "estudo",
        "description" : "Desenvolvi uma Pokedex usando Angular e TypeScript para aprimorar minhas habilidades com essas tecnologias. O projeto lista pokémons por geração, com detalhes como evoluções e versões shiny.",
        "text" : "O projeto 'Pokemon em Angular' foi desenvolvido para aprender Angular com TypeScript e aprimorar minhas habilidades de design, sem seguir um layout pré-definido. A Pokedex permite aos usuários explorar pokémons listados por geração, com informações detalhadas sobre versões alternativas, evoluções, versões shiny e status.</br></br>Construído com HTML, CSS, Sass/SCSS, TypeScript e Angular, o site utiliza AJAX para carregar novos itens dinamicamente. Embora a funcionalidade de busca ainda não tenha sido implementada, é uma característica que planejo adicionar para melhorar a navegação e facilitar a pesquisa de pokémons específicos.</br></br>O desafio principal foi se familiarizar com a criação de rotas e o uso de providers no Angular, sendo este meu segundo projeto com a tecnologia. A experiência foi essencial para consolidar meu entendimento sobre o desenvolvimento em Angular e aprimorar minhas habilidades na construção de aplicações complexas.</br></br>Este projeto é voltado para fãs de Pokémon que procuram uma forma simples e eficiente de acessar informações detalhadas sobre seus pokémons favoritos.",
        "categories" : [1,2,3,5,7],
        "link_project" : "https://caiovf.github.io/angular-pokedex/",
        "link_github" : "https://github.com/caiovf/angular-pokedex",
        "full_project_img" : "",
        "current_online" : 1
    },
    {
        "id" : 5,
        "title" : "Blog Pessoal",
        "slug" : "blog-pessoal",
        "thumbnail" : "https://raw.githubusercontent.com/caiovf/react-portfolio/main/src/assets/img/projeto-6.jpg",
        "project_type": "estudo",
        "description" : "Desenvolvi um blog pessoal para aprender sobre desenvolvimento moderno de sites. Usando HTML, CSS e Angular, criei um blog com componentes reutilizáveis e dados mockados, sem integração com APIs. O projeto ajudou a entender melhor o desenvolvimento de sites e sistemas.",
        "text" : "O projeto 'Blog Pessoal' foi desenvolvido com o objetivo de aprofundar meus conhecimentos em desenvolvimento moderno de sites, saindo do ambiente tradicional com PHP, WordPress e JavaScript puro. Neste projeto, utilizei HTML, CSS e Angular para criar um blog funcional sem a necessidade de integração com APIs, utilizando dados mockados para simulação.</br></br>O blog conta com uma página principal que apresenta cards de blog reutilizáveis. Cada card é um componente único que se adapta com base nos parâmetros recebidos, permitindo uma exibição consistente de imagem, título e descrição. A página principal inclui uma listagem com um botão de 'carregar mais', e a página interna exibe o texto principal de cada postagem.</br></br>O maior desafio foi desenvolver um componente de blog reutilizável que atendesse às necessidades do projeto sem a criação de múltiplos cards distintos. A solução foi criar um componente versátil que se adapta às informações fornecidas, garantindo eficiência e manutenção simplificada.</br></br>Embora o projeto não tenha um público-alvo específico, ele foi fundamental para compreender melhor as práticas de desenvolvimento moderno de sites e sistemas, ampliando minha experiência com Angular e técnicas de design responsivo.",
        "categories" : [1,2,3,7],
        "link_project" : "https://caiovf.github.io/angular-blog/",
        "link_github" : "https://github.com/caiovf/angular-blog",
        "full_project_img" : "",
        "current_online" : 1
    }
]